{
	"title": "Quien soy",
	"subtitle": "Mi código no es bueno, es '<1>Caralludo</1>'",
	"description": "<p>Buenas, me llamo <strong>Ricardo Soto Estévez</strong> y soy natural de <strong>Noia</strong> (A Coruña), aunque actualmente resido en Oviedo (Uviéu). Empecé a programar con doce años, siguiendo un tutorial aleatorio que me apareció en Youtube de Python, y no he parado de hacer código desde entonces. Ahora ya soy un desarrollador profesional dedicándose a lo que más le gusta.</p><p>Me gradué en <strong>Ingeniería Informática del Software</strong> en la Universidad de Oviedo con una nota media de 8 y obteniendo un 9.5 en mi Trabajo de Fin de Grado, <strong>AllForOne</strong>, una aplicación móbil y API en la nube para asistir a familias con personas afectadas de Alzheimer. Este proyecto me mostró cuanto puedo aportar al mundo con mis habilidades de programación.</p><p>Como profesional trabajo implementando <strong>sistemas backend</strong>. En mi posición actual estoy desarrollando un motor de búsqueda para e-commerces nacido de una colaboración entre empresas de Europa y América. Mis mejores habilidades como ingeniero de software son el diseño de software y la <strong>aplicación de patrones</strong>. Me gusta mucho iterar para seguir mejorando todos los compoñentes que hago para que sean lo más pulidos posibles.</p><p>Fuera del trabajo, mis principales aficiones son los <strong>videojuegos</strong> y la <strong>literatura de fantasía</strong>. Soy muy fan de los Souls-like y de Brandon Sanderson. También programo mucho en mi tiempo libre ya que siempre tengo algún proyecto paralelo entre manos para mejorar mis capacidades o adquirir nuevas. En la seguinte sección podrás ver algunos de esos proyectos.</p>",
	"alt": {
		"cratesio": "Icono que redirige a mi perfil en crates.io",
		"github": "Icono que redirige a mi perfil en GitHub",
		"itchio": "Icono que redirige a mi perfil en itch.io",
		"linkedin": "Icono que redirige a mi perfil en LinkedIn",
		"mastodon": "Icono que redirige a mi perfil en mastodon",
		"me": "Retrato de Soto Estévez",
		"medium": "Icono que redirige a mi perfil en Medium",
		"sign": "Firma animada"
	}
}