{
	"title": "Port folio",
	"allforone": {
		"name": "AllForOne",
		"subtitle": "Herramienta de asistencia a familias afectadas por el Alzheimer",
		"description": "AllForOne es mi <strong>Trabajo de Fin de Grado</strong>. Es una aplicación Android de asistencia para familias con algún miembro afectado por la <strong>enfermedad de Alzheimer</strong> proporcionando herramientas como un gestor de tareas compartido, geolocalización o un chat en tiempo real, todo esto construido sobre un sistema de vinculación. Consiste en dos grandes módulos: el cliente, una <strong>aplicación Android</strong> hecha en Kotlin; y el servicio de back, una <strong>API en Node.js</strong> desplegada en Azure. La comunicación entre estos dos extremos se realiza tanto a través de HTTP con una API REST como por vía de WebSockets, según el caso de uso."
	},
	"medium": {
		"name": "Medium Blog",
		"subtitle": "Artículos cada dos semanas sobre programación",
		"description": "En mayo de 2022 creé un nuevo perfil en Medium con la intención de redactar artículos periódicamente, con una primera meta de publicar un artículo nuevo cada dos semanas. La línea de contenido de los artículos es la <strong>programación</strong> con un gran foco puesto en el ecosistema de <strong>Rust</strong> y mi experiencia personal. Los temas de esos artículso van desde disecciones y análisis de pedazos de código interesante a trucos y tutoriales con énfasis en enseñar técnicas útiles o detalles que puedan mejorar las habilidades de programación del lector o, al menos, servir de curiosidad. Los artículos cuenta con una buen recepción y un gran crecimiento, lo que condujo a que también hayan sido seleccionados para ser publicados en <strong>BetterProgramming</strong>, una publicación con más de <strong>200K seguidores</strong> en Medium, editada por el propio CEO de Medium."
	},
	"oito": {
		"name": "Oito",
		"subtitle": "Emulador de Chip-8",
		"description": "Oito es un emulador de la <strong>máquina virtual de Chip-8</strong> completamente escrito en Rust con un fuerte esfuerzo en el desarrollo del código más léxico y autoexplicativo posible. Este proyecto se compone de tres paquetes principales: el <strong>core</strong>, que implementa toda la lógica back; el <strong>front de escritorio</strong>, que emplea la librería SDL2; y la <strong>librería web</strong> para compilar el emulador a WebAssembly y ejecutar en una página web. La versión web del emulador se puede usar en el enlace dispuesto a continuación."
	},
	"bresenhamzip": {
		"name": "Bresenham Zip",
		"subtitle": "Librería para facilitar el uso del algoritmo de Bresenham con dos líneas",
		"description": "El <strong>algoritmo de Bresenham</strong> es un algoritmo de generación de puntos entre dos vectores, es usado habitualmente para dibujar rectas. Es por esto que también se emplea para obtener los puntos dentro de un polígono (por lo general, un triángulo) ejecutando el algoritmo entre dos líneas para calcular las rectas horizontales y verticales cubriendo la susodicha área. BresenhamZip proporciona <strong>un iterador</strong> que retorna los vectores de esas líneas. Soporta vectores <strong>genéricos</strong>, funciona en <strong>2D</strong> y <strong>3D</strong> y ofrece macros de utilidad."
	},
	"cows": {
		"name": "COWS",
		"subtitle": "Sencilla aplicación de agregración de noticias del Covid-19",
		"description": "Dos compañeros y yo desarrollamos esta aplicación durante la cuarentena para asistir con el <strong>Covid-19</strong>. Fue nuestra primera aplicación para Android y su propósito es el de ofrecer una herramienta sencilla de utilizar que pudiese ayudar a todo el mundo a dar el primer vistazo del día a las <strong>noticias de la pandemia</strong>. La lista de noticias se obtiene del <strong>RSS</strong> de cuatro periódicos distintos y las noticias pueden ser guardadas o compartidas. La aplicación se encuentra disponible en Google Play y cuenta con una cierta base de usuarios."
	},
	"shotdown": {
		"name": "Shotdown",
		"subtitle": "Juego deathmatch 1v1 con gran movilidad y variedad de armas",
		"description": "Shotdown es un juego construído desde cero con C++ usando <strong>Chipmunk2D</strong> como motor de físicas y <strong>SDL2</strong> para el manejo de los gráficos y el audio. El juego es un duelo a muerte multijugador entre dos personajes con gran movilidad gracias a habilidades como <strong>dashes o saltos de pared</strong>. En diferentes puntos del mapa aparecerán diversas armas que pueden ser cogidas por los jugadores para poder matar a su rival, hay un total de <strong>diez armas</strong>. Los duelos también se pueden personalizar con opciones como: muerte a un golpe, todo aleatorio o seleccionando el número de enfrentamientos a ejecutar."
	},
	"thepartingofsarah": {
		"name": "The Parting of Sarah",
		"subtitle": "Juego rogue-like proceduralmente generado en vista top-down",
		"description": "The Parting of Sarah es <strong>mi primer videojuego</strong>. A excepción del audio y el renderizado, implementados con SDL2, toda la lógica del juego fue <strong>hecha desde cero</strong> usando C++. El juego trata de un personaje llamado Sara y de su ascenso a través de una serie de pisos inundados de enemies hasta que se muera y se deba empezar de nuevo de cero. Cada piso y enemigo está <strong>proceduralmente generado</strong>. El personaje puede progresar subiendo de nivel y adquiriendo items que otorga nuevas habilidades o mejoras. El juego ofrece siete enemigos distintos, siete mejoras y cuatro jefes."
	},
	"links": {
		"api": "API",
		"app": "Aplicación",
		"article": "Artículo",
		"crate": "Crate",
		"doc": "Documentación",
		"googleplay": "Google Play",
		"institution": "Repositorio institucional",
		"itchio": "Itch.io",
		"paper": "Documento",
		"publication": "Publicación",
		"repo": "Repositorio",
		"webemu": "Emulador web"
	}
}