{
	"title": "About me",
	"subtitle": "My code is not just good, it's '<1>Caralludo</1>'",
	"description": "<p>Hi, I'm <strong>Ricardo Soto Estévez</strong> and I'm from <strong>Noia</strong>, a little town in Galicia (Spain), but I've been also living in A Coruña and Oviedo, where I am at the moment. I started coding when I was twelve, following a random YouTube tutorial of Python and have been coding non-stop since that moment. Now I'm a profesional developer doing what I love the most.</p><p>I got my degree in <strong>Software Engineering</strong> at the University of Oviedo with an average mark of 8 and getting a score of 9.5 with my end-of-degree project, <strong>AllForOne</strong>, a mobile application and cloud API to help families diagnosed with Alzheimer. That project showed how much I can contribute to the world through my coding skills.</p><p>As a profesional I work the most developing <strong>backend systems</strong>. In my current position I'm developing a search engine for e-commerces born from a collaboration between companies of Europe and America. My best skills coding are the software design and the <strong>application of patterns</strong>. I like a lot to iterate and keep improving all the components to build the best possible code at the reach of my hand.</p><p>Outside of the work, my main hobbies are the <strong>videogames</strong> and <strong>fantasy literature</strong>. I'm a die hard fan of Souls-like games and Brandon Sanderson. I also code a lot on my free time, I always have active some side project to hone my skills or learn new things. You can see some of my creations in the next part.</p>",
	"alt": {
		"cratesio": "Icon linking to the crates.io profile",
		"github": "Icon linking to the GitHub profile",
		"itchio": "Icon linking to the itch.io profile",
		"linkedin": "Icon linking to the LinkedIn profile",
		"mastodon": "Icon linking to the mastodon profile",
		"me": "Portrait of Soto Estévez",
		"medium": "Icon linking to the Medium profile",
		"sign": "Animated signing"
	}
}