{
	"title": "Quen son",
	"subtitle": "Meu código non é bo, é '<1>Caralludo</1>'",
	"description": "<p>Ola, chámome <strong>Ricardo Soto Estévez</strong> e son natural de <strong>Noia</strong>, galego de corazón, mais agora ando a vivir fora de terriña, en Uviéu. Eu comecei a programar con doce anos, seguindo un tutorial que me apareceu en Youtube de Python e non parei de facer código sen parar dende entón. Agora xa son un desarrollador profesional facendo o que máis gosto.</p><p>Gradueime en <strong>Enxeñaría Informática do Software</strong> na Universidade de Uviéu (malia que antes pasei pola de A Coruña) cunha nota media de 8 e obtendo un 9.5 con meu Traballo de Fin de Grado, <strong>AllForOne</strong>, unha aplicación móbil e API na nube para axudar a familias con persoas afectadas de Alzheimer. Ese proxecto mostroume canto podo aportar ao mundo coas miñas habilidades de programación.</p><p>Coma profesional traballo implementando <strong>sistemas backend</strong>. Na miña posición actual estou a desarrollador un motor de búsqueda para e-commerces nato dunha colaboración entra empresas de Europa e América. Miñas mellores habilidades coma enxeñeiro de software son o deseño de software e a <strong>aplicación de patróns</strong>. Góstame moito iterar para seguir mellorando tódolos compoñentes que fago para que sexan os máis pulidos posibles.</p><p>Fóra do curro, miñas principais aficións son os <strong>videoxogos</strong> e a <strong>literatura de fantasía</strong>. Son moi fan dos Souls-like e de Brandon Sanderson. Tamén programo moito no meu tempo libre xa que sempre teño algún proxecto entre mans para mellorar as miñas capacidades ou adquirir novas. Na seguinte sección poderas ver algúns deses proxectos.</p>",
	"alt": {
		"cratesio": "Ícono que redirixe cara o meu perfil en crates.io",
		"github": "Ícono que redirixe cara o meu perfil en GitHub",
		"itchio": "Ícono que redirixe cara o meu perfil en itch.io",
		"linkedin": "Ícono que redirixe cara o meu perfil en LinkedIn",
		"mastodon": "Ícono que redirixe cara o meu perfil en mastodon",
		"me": "Retrato de Soto Estévez",
		"medium": "Ícono que redirixe cara o meu perfil en Medium",
		"sign": "Firma animada"
	}
}