{
	"title": "Port folio",
	"allforone": {
		"name": "AllForOne",
		"subtitle": "Ferramenta de asistencia a familias afectadas polo Alzheimer",
		"description": "AllForOne é o meu <strong>Traballo de Fin de Grao</strong>. É unha aplicación Android de axuda para familias con algún membro afectado pola <strong>enfermidade de Alzheimer</strong> proporcionando ferramentas como un xestor de tarefas compartido, xeolocalización ou un chat en tempo real, todo isto construido enriba dun sistema de vinculación. Consiste en dous grandes módulos: o cliente, unha <strong>aplicación Android</strong> feita en Kotlin; e o servizo do back, unha <strong>API en Node.js</strong> desplegada en Azure. A comunicación entre estos dous extremos realízase tanto a través de HTTP cunha API REST como por vía de WebSockets segundo o caso."
	},
	"medium": {
		"name": "Medium Blog",
		"subtitle": "Artículos cada dos semanas sobre programación",
		"description": "En maio de 2022 creei un novo perfil en Medium coa intención de redactar artigos periódicamente, cunha primeira meta de publicar un artigo novo cada dúas semanas. A liña de contido dos artigos é a <strong>programación</strong> cun grande foco no ecosistema de <strong>Rust</strong> e a miña experiencia persoal. Os temas de esos artigos van dende disección e análisis de anacos de código interesante a trucos e tutoriais con énfasis na ensinanza de técnicas útiles ou detalles que poden mellorar as destrezas de programación do lector ou, polo menos, servir de curiosidade. Os artigos contan con boa recepción e un crecemento destacábel, o que conduxo a que tamén sexan seleccionados para ser publicados en <strong>BetterProgramming</strong>, unha publicación con máis de <strong>200 mil seguidores</strong> en Medium, editada polo propio CEO de Medium."
	},
	"oito": {
		"name": "Oito",
		"subtitle": "Emulador de Chip-8",
		"description": "Oito é un emulador da <strong>máquina virtual de Chip-8</strong> completamente escrito en Rust con forte esforzo no desarrollo do código más léxico e autoexplicativo posíble. O proxecto está composto de tres paquetes principais: o <strong>core</strong>, que implementa toda a lóxica do back; o <strong>front de escritorio</strong>, que emplea a librería SDL2; e a <strong>librería web</strong> para compilar o emulador a WebAssembly e executalo nunha páxina web. A versión web do emulador pódese usar no enlace disposto a continuación."
	},
	"bresenhamzip": {
		"name": "Bresenham Zip",
		"subtitle": "Libraría para facilitar o uso do algoritmo de Bresenham con dúas liñas",
		"description": "O <strong>algoritmo de Bresenham</strong> é un algoritmo de xeración de puntos entre dous vectores, é usado habitualmente para debuxar liñas. É por isto que tamén se emprega para obter os puntos dentro dun polígono (xeralmente, un triángulo) executando o algoritmo entre dúas liñas para calcular as rectas horizontais e verticais cubriendo a devandita área. BresenhamZip proporciona <strong>un iterador</strong> que retorna os vectores desas liñas. Soporta vectores <strong>xenéricos</strong>, funciona en <strong>2D</strong> e <strong>3D</strong> e ofrece macros de utilidade."
	},
	"cows": {
		"name": "COWS",
		"subtitle": "Sinxela aplicación de agregración de noticias da Covid-19",
		"description": "Dous compañeiros e eu desarrollamos esta aplicación durante a corentena para asistir coa <strong>Covid-19</strong>. Foi a nosa primeira aplicación para Android e o seu propósito é o de ofrecer unha ferramenta sinxela de usar que puidese axudar a todo o mundo a dar o primeiro vistazo do día ás <strong>noticias da pandemia</strong>. A lista de noticias obtense dos <strong>RSS</strong> de catro diarios distintos a as noticias poden ser gardadas ou compartidas. A aplicación está dispoñible na tenda de Google Play e conta cunha certa base de usuarios."
	},
	"shotdown": {
		"name": "Shotdown",
		"subtitle": "Xogo deathmatch 1v1 con gran mobilidade e variedade de armas",
		"description": "Shotdown é un xogo construido dende cero con C++ usando <strong>Chipmunk2D</strong> coma motor de físicas e <strong>SDL2</strong> para o manello dos gráficos e o audio. O xogo é unha loita a morte multixogador entre dous personaxes con gran mobilidade grazas a habilidades coma <strong>dashes ou saltos de parede</strong>. En diferentes puntos do mapa aparecerán diversas armas que poden ser collidas polos xogadores para poder matar ao seu rival, hai un total de <strong>dez armas</strong>. A loitas tamén se poden personalizar con opcións coma: morte a un golpe, todo aleatorio ou selecionando o número de enfrentamentos a executar."
	},
	"thepartingofsarah": {
		"name": "The Parting of Sarah",
		"subtitle": "Xogo rogue-like proceduralmente xerado en vista top-down",
		"description": "The Parting of Sarah é o <strong>meu primeiro videoxogo</strong>. Agás o audio e o renderizado, implementados con SDL2, toda a lóxico do xogo foi <strong>feita dende cero</strong> usando C++. O xogo trata dunha personaxe chamada Sara e do seu ascenso a través dunha serie de andares cheos de inimigos ata que se morra e se teña que empezar de cero outra vez. Cada andar e inimigo está <strong>xerado proceduralmente</strong>. O persoaxe pode progresar subindo de nivel e adquirindo items que otorgan novas habilidades e melloras. O xogo ofrece sete inimigos distintos, sete melloras e catro xefes."
	},
	"links": {
		"api": "API",
		"app": "Aplicación",
		"article": "Artigo",
		"crate": "Crate",
		"doc": "Documentación",
		"googleplay": "Google Play",
		"institution": "Repositorio institucional",
		"itchio": "Itch.io",
		"paper": "Documento",
		"publication": "Publicación",
		"repo": "Repositorio",
		"webemu": "Emulador web"
	}
}